RT-Thread/rt-thread/bsp/gd32/arm/libraries/GD32H7xx_Firmware_Library/GD32H7xx_standard_peripheral/Source/gd32h7xx_mdma.c
/*!
    \brief      configure transfer burst beats of source
    \param[in]  channelx: specify which MDMA channel
                only one parameter can be selected which is shown as below:
      \arg        MDMA_CHx(x=0..15)
    \param[in]  sbeat: source transfer burst beats
      \arg        MDMA_SOURCE_BURST_SINGLE: source transfer single burst
      \arg        MDMA_SOURCE_BURST_2BEATS: source transfer 2-beat burst
      \arg        MDMA_SOURCE_BURST_4BEATS: source transfer 4-beat burst
      \arg        MDMA_SOURCE_BURST_8BEATS: source transfer 8-beat burst
      \arg        MDMA_SOURCE_BURST_16BEATS: source transfer 16-beat burst
      \arg        MDMA_SOURCE_BURST_32BEATS: source transfer 32-beat burst
      \arg        MDMA_SOURCE_BURST_64BEATS: source transfer 64-beat burst
      \arg        MDMA_SOURCE_BURST_128BEATS: source transfer 128-beat burst
    \param[out] none
    \retval     none
*/
void mdma_source_burst_beats_config(mdma_channel_enum channelx, uint32_t sbeat)
{
    /* configure transfer burst beats of source */
    MDMA_CHXCFG(channelx) &= ~MDMA_CHXCFG_SBURST;
    MDMA_CHXCFG(channelx) |= sbeat;
}

/*!
    \brief      configure transfer burst beats of destination
    \param[in]  channelx: specify which MDMA channel
                only one parameter can be selected which is shown as below:
      \arg        MDMA_CHx(x=0..15)
    \param[in] dbeat: destination transfer burst beats
                only one parameter can be selected which is shown as below:
      \arg        MDMA_DESTINATION_BURST_SINGLE: destination transfer single burst
      \arg        MDMA_DESTINATION_BURST_2BEATS: destination transfer 2-beat burst
      \arg        MDMA_DESTINATION_BURST_4BEATS: destination transfer 4-beat burst
      \arg        MDMA_DESTINATION_BURST_8BEATS: destination transfer 8-beat burst
      \arg        MDMA_DESTINATION_BURST_16BEATS: destination transfer 16-beat burst
      \arg        MDMA_DESTINATION_BURST_32BEATS: destination transfer 32-beat burst
      \arg        MDMA_DESTINATION_BURST_64BEATS: destination transfer 64-beat burst
      \arg        MDMA_DESTINATION_BURST_128BEATS: destination transfer 128-beat burst
    \param[out] none
    \retval     none
*/
void mdma_destination_burst_beats_config(mdma_channel_enum channelx, uint32_t dbeat)
{
    /* configure transfer burst beats of destination */
    MDMA_CHXCFG(channelx) &= ~MDMA_CHXCFG_DBURST;
    MDMA_CHXCFG(channelx) |= dbeat;
}

/*!
    \brief      configure data size of source
    \param[in]  channelx: specify which MDMA channel
                only one parameter can be selected which is shown as below:
      \arg        MDMA_CHx(x=0..15)
    \param[in]  swidth: source data size
                only one parameter can be selected which is shown as below:
      \arg        MDMA_SOURCE_DATASIZE_8BIT: source data size is byte
      \arg        MDMA_SOURCE_DATASIZE_16BIT: source data size is half word
      \arg        MDMA_SOURCE_DATASIZE_32BIT: source data size is word
      \arg        MDMA_SOURCE_DATASIZE_64BIT: source data size is double word
    \param[out] none
    \retval     none
*/
void mdma_source_width_config(mdma_channel_enum channelx, uint32_t swidth)
{
    /* configure data size of source */
    MDMA_CHXCFG(channelx) &= ~MDMA_CHXCFG_SWIDTH;
    MDMA_CHXCFG(channelx) |= swidth;
}

/*!
    \brief      configure data size of destination
    \param[in]  channelx: specify which MDMA channel
                only one parameter can be selected which is shown as below:
      \arg        MDMA_CHx(x=0..15)
    \param[in]  dwidth: destination data size
                only one parameter can be selected which is shown as below:
      \arg        MDMA_DESTINATION_DATASIZE_8BIT: destination data size is byte
      \arg        MDMA_DESTINATION_DATASIZE_16BIT: destination data size is half word
      \arg        MDMA_DESTINATION_DATASIZE_32BIT: destination data size is word
      \arg        MDMA_DESTINATION_DATASIZE_64BIT: destination data size is double word
    \param[out] none
    \retval     none
*/
void mdma_destination_width_config(mdma_channel_enum channelx, uint32_t dwidth)
{
    /* configure data size of source */
    MDMA_CHXCFG(channelx) &= ~MDMA_CHXCFG_DWIDTH;
    MDMA_CHXCFG(channelx) |= dwidth;
}

/*!
    \brief      configure source adress increment mode
    \param[in]  channelx: specify which MDMA channel
                only one parameter can be selected which is shown as below:
      \arg        MDMA_CHx(x=0..15)
    \param[in]  sinc: source adress increment mode
                only one parameter can be selected which is shown as below:
      \arg        MDMA_SOURCE_INCREASE_DISABLE: no increment
      \arg        MDMA_SOURCE_INCREASE_8BIT: source address pointer is incremented by a byte (8 bits)
      \arg        MDMA_SOURCE_INCREASE_16BIT: source address pointer is incremented by a half word (16 bits)
      \arg        MDMA_SOURCE_INCREASE_32BIT: source address pointer is incremented by a word (32 bits)
      \arg        MDMA_SOURCE_INCREASE_64BIT: source address pointer is incremented by a double word (64 bits)
      \arg        MDMA_SOURCE_DECREASE_8BIT: source address pointer is decremented by a byte (8 bits)
      \arg        MDMA_SOURCE_DECREASE_16BIT: source address pointer is decremented by a half word (16 bits)
      \arg        MDMA_SOURCE_DECREASE_32BIT: source address pointer is decremented by a word (32 bits)
      \arg        MDMA_SOURCE_DECREASE_64BIT: source address pointer is decremented by a double word (64 bits)
    \param[out] none
    \retval     none
*/
void mdma_source_increment_config(mdma_channel_enum channelx, uint32_t sinc)
{
    /* configure adress increment mode of source */
    MDMA_CHXCFG(channelx) &= ~(MDMA_CHXCFG_SIMOD | MDMA_CHXCFG_SIOS);
    MDMA_CHXCFG(channelx) |= sinc;
}

/*!
    \brief      configure destination adress increment mode
    \param[in]  channelx: specify which MDMA channel
                only one parameter can be selected which is shown as below:
      \arg        MDMA_CHx(x=0..15)
    \param[in]  dinc: destination adress increment mode
                only one parameter can be selected which is shown as below:
      \arg        MDMA_DESTINATION_INCREASE_DISABLE: no increment
      \arg        MDMA_DESTINATION_INCREASE_8BIT: destination address pointer is incremented by a byte (8 bits)
      \arg        MDMA_DESTINATION_INCREASE_16BIT: destination address pointer is incremented by a half word (16 bits)
      \arg        MDMA_DESTINATION_INCREASE_32BIT: destination address pointer is incremented by a word (32 bits)
      \arg        MDMA_DESTINATION_INCREASE_64BIT: destination address pointer is incremented by a double word (64 bits))
      \arg        MDMA_DESTINATION_DECREASE_8BIT: destination address pointer is decremented by a byte (8 bits)
      \arg        MDMA_DESTINATION_DECREASE_16BIT: destination address pointer is decremented by a half word (16 bits)
      \arg        MDMA_DESTINATION_DECREASE_32BIT: destination address pointer is decremented by a word (32 bits)
      \arg        MDMA_DESTINATION_DECREASE_64BIT: destination address pointer is decremented by a double word (64 bits)
    \param[out] none
    \retval     none
*/
void mdma_destination_increment_config(mdma_channel_enum channelx, uint32_t dinc)
{
    /* configure adress increment mode of destination */
    MDMA_CHXCFG(channelx) &= ~(MDMA_CHXCFG_DIMOD | MDMA_CHXCFG_DIOS);
    MDMA_CHXCFG(channelx) |= dinc;
}

/*!
    \brief      enable MDMA channel bufferable write mode
    \param[in]  channelx: specify which MDMA channel
                only one parameter can be selected which is shown as below:
      \arg        MDMA_CHx(x=0..15)
    \param[out] none
    \retval     none
*/
void mdma_channel_bufferable_write_enable(mdma_channel_enum channelx)
{
    MDMA_CHXCFG(channelx) |= MDMA_CHXCFG_BWMOD;
}

/*!
    \brief      disable MDMA channel bufferable write mode
    \param[in]  channelx: specify which MDMA channel
                only one parameter can be selected which is shown as below:
      \arg        MDMA_CHx(x=0..15)
    \param[out] none
    \retval     none
*/
void mdma_channel_bufferable_write_disable(mdma_channel_enum channelx)
{
    MDMA_CHXCFG(channelx) &= ~MDMA_CHXCFG_BWMOD;
}

/*!
    \brief      enable MDMA channel software request
    \param[in]  channelx: specify which MDMA channel
                only one parameter can be selected which is shown as below:
      \arg        MDMA_CHx(x=0..15)
    \param[out] none
    \retval     none
*/
void mdma_channel_software_request_enable(mdma_channel_enum channelx)
{
    MDMA_CHXCTL0(channelx) |= MDMA_CHXCTL0_SWREQ;
}

/*!
    \brief      enable MDMA channel
    \param[in]  channelx: specify which MDMA channel
                only one parameter can be selected which is shown as below:
      \arg        MDMA_CHx(x=0..15)
    \param[out] none
    \retval     none
*/
void mdma_channel_enable(mdma_channel_enum channelx)
{
    MDMA_CHXCTL0(channelx) |= MDMA_CHXCTL0_CHEN;
}

/*!
    \brief      disable MDMA channel
    \param[in]  channelx: specify which MDMA channel
                only one parameter can be selected which is shown as below:
      \arg        MDMA_CHx(x=0..15)
    \param[out] none
    \retval     none
*/
void mdma_channel_disable(mdma_channel_enum channelx)
{
    MDMA_CHXCTL0(channelx) &= ~MDMA_CHXCTL0_CHEN;
}

/*!
    \brief      get MDMA transfer error direction
    \param[in]  channelx: specify which MDMA channel
                only one parameter can be selected which is shown as below:
      \arg        MDMA_CHx(x=0..15)
    \param[out] none
    \retval     transfer error direction: MDMA_READ_ERROR or MDMA_WRITE_ERROR
*/
uint32_t mdma_transfer_error_direction_get(mdma_channel_enum channelx)
{
    return (MDMA_CHXSTAT1(channelx) & MDMA_CHXSTAT1_TERRD);
}

/*!
    \brief      get MDMA transfer error address
    \param[in]  channelx: specify which MDMA channel
                only one parameter can be selected which is shown as below:
      \arg        MDMA_CHx(x=0..15)
    \param[out] none
    \retval     the low 7 bits of the transfer error address
*/
uint32_t mdma_transfer_error_address_get(mdma_channel_enum channelx)
{
    return (uint32_t)(MDMA_CHXSTAT1(channelx) & MDMA_CHXSTAT1_ERRADDR);
}

/*!
    \brief      get MDMA flag
    \param[in]  channelx: specify which MDMA channel to clear flag
                only one parameter can be selected which is shown as below:
      \arg        MDMA_CHx(x=0..15)
    \param[in]  flag: specify get which flag
                only one parameter can be selected which is shown as below:
      \arg        MDMA_FLAG_ERR: transfer error flag
      \arg        MDMA_FLAG_CHTCF: channel transfer complete flag
      \arg        MDMA_FLAG_MBTCF: multi-block transfer complete flag
      \arg        MDMA_FLAG_BTCF: block transfer complete flag
      \arg        MDMA_FLAG_TCF: buffer transfer complete flag
      \arg        MDMA_FLAG_REQAF: request active flag
      \arg        MDMA_FLAG_LDTERR: link data transfer error flag in the last transfer of the channel
      \arg        MDMA_FLAG_MDTERR: mask data error flag
      \arg        MDMA_FLAG_ASERR: address and size error flag
      \arg        MDMA_FLAG_BZERR: block size error flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus mdma_flag_get(mdma_channel_enum channelx, uint32_t flag)
{
    uint32_t flag_pos = 0U;

